#基本格式
list = ['元素1', '元素2', '元素3', '元素4', '元素5'] 

#列表索引  ,列表的第1个元素索引为0，第2个元素索引为1，以此类推
# print(list[0]) #输出列表的第1个元素 
# print(list[1]) #输出列表的第2个元素
# print(list[2]) #输出列表的第3个元素
# print(list[3]) #输出列表的第4个元素
# print(list[4]) #输出列表的第5个元素

# #列表切片
# print(list[0:3]) #输出列表的第1-3个元素
# print(list[1:4]) #输出列表的第2-4个元素
# print(list[:3]) #输出列表的第1-3个元素
# print(list[2:5]) #输出列表的第3-5个元素
# print(list[3:5]) #输出列表的第4-5个元素
# print(list[:5]) #输出列表的前5个元素

# print(list[-1]) #输出列表的最后一个元素
# print(list[-2]) #输出列表的倒数第二个元素


print( 'a' in list[0][2]) #输出列表第1个元素的第3个字符的ASCII码
